import view
import addContact

# userList = [{'Фамилия': 'Иванов'}, {'Фамилия': 'Иванов1'}, {'Фамилия': 'Иванов2'}, {'Имя': 'Иван'}, {'Имя': 'Иван1'}, {'Имя': 'Иван2'},
#             {'Название предмета': 'География'},  {'Оценка ': '5'}]


userList = [
    [{'Фамилия': 'Иванов'}, {'Имя': 'Иван'}, {
        'Название предмета': 'География'}, {'Оценка': '5'}],
    [{'Фамилия': 'Иванов1'}, {'Имя': 'Иван1'}, {
        'Название предмета': 'Биология'}, {'Оценка': '4'}],
    [{'Фамилия': 'Смирнов'}, {'Имя': 'Иван2'}, {'Название предмета': 'Химия'}, {'Оценка': '4'}]]


def ClickButton():
    numMenu = view.ShowMenu()
    while True:
        if numMenu == '1':
            view.showUser(userList)
            return
        elif numMenu == '2':
            view.ShowGrade(userList)
            return
        elif numMenu == '4':
            view.AddUser(userList)
            return
